/*
 * @Author: kael 
 * @Date: 2018-02-14 17:50:28 
 * @Last Modified by: kael
 * @Last Modified time: 2018-03-10 22:49:41
 */

// 身份证规则：
// 身份证号码为15位或者18位
// 15位时全为数字
// 18位前17位为数字
// 最后一位是校验位，可能为数字或字符X 
// 前六位为地区编码
// 第七位开始 是出生日期

module.exports = {
  mobile: /^1\d{10}$/,
  qq: /^[1-9]\d{4,10}$/,
  number: /^[-+]?(?:\d*|(?=\d))(\.\d*)?$/,
  email: /^\w+.?[\w]?@[\w.]+\.[a-zA-Z]+$/,
  url: /^(https|http|ftp):\/\/([a-zA-Z\d]+\.{1})+[a-zA-Z]+$/,
  ipv4: /^(25[0-5]|2[0-4]\d|[0-1]?\d?\d)(\.(25[0-5]|2[0-4]\d|[0-1]?\d?\d)){3}$/,
  idcard: /(^\d{6}(19|20)\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^\d{6}(19|20)\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}$)/,
};