/*
 * @Author: kael
 * @Date: 2018-02-14 17:50:28
 * @Last Modified by: kael
 * @Last Modified time: 2018-03-10 22:49:41
 */

module.exports = {
  mobile: /^1[3-8]\d{9}$/, // https://zh.wikipedia.org/wiki/%E4%B8%AD%E5%9B%BD%E5%86%85%E5%9C%B0%E7%A7%BB%E5%8A%A8%E7%BB%88%E7%AB%AF%E9%80%9A%E8%AE%AF%E5%8F%B7%E6%AE%B5
  qq: /^[1-9]\d{4,10}$/,
  number: /^(?:[-+](\.?))?(?:\d*|(?=\d))(\.\d*)?$/,

  /*
  Email的规则: name@domain
  name最长64，domain最长253，总长最长256
  name可以使用任意ASCII字符:
    大小写英文字母 a-z,A-Z
    数字 0-9
    字符 !#$%&'*+-/=?^_`{|}~
    字符 .不能是第一个和最后一个，不能连续出现两次
    但是有些邮件服务器会拒绝包含有特殊字符的邮件地址
    domain仅限于26个英文字母、10个数字、连词号-
    连词号-不能是第一个字符
    顶级域名（com、cn等）长度为2到6个
  */
  email: /^([\w-_]+(?:\.[\w-_]+)*)@((?:[a-z0-9]+(?:-[a-zA-Z0-9]+)*)+\.[a-z]{2,6})$/i,

  /*
    参考地址: https://soulteary.com/2014/12/05/better-url-regexp-in-js.html
   */
  url: /(((^https?:(?:\/\/)?)(?:[-;:&=\+\$,\w]+@)?[A-Za-z0-9.-]+|(?:www.|[-;:&=\+\$,\w]+@)[A-Za-z0-9.-]+)((?:\/[\+~%\/.\w-_]*)?\??(?:[-\+=&;%@.\w_]*)#?(?:[\w]*))?)$/g,

  /*
  IPV4地址由4个组数字组成，每组数字之间以.分隔，每组数字的取值范围是0-255。
  IPV4必须满足以下四条规则：
    -> 任何一个1位或2位数字，即0-99；
    -> 任何一个以1开头的3位数字，即100-199；
    -> 任何一个以2开头、第2位数字是0-4之间的3位数字，即200-249;
    -> 任何一个以25开头，第3位数字在0-5之间的3位数字，即250-255。
  */
  ipv4: /^(((\d{1,2})|(1\d{2})|(2[0-4]\d)|(25[0-5]))\.){3}((\d{1,2})|(1\d{2})|(2[0-4]\d)|(25[0-5]))$/,
  // https://segmentfault.com/a/1190000014024798
  idcard: /^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/,
};