/*
 * @Author: kael 
 * @Date: 2018-02-14 17:50:28 
 * @Last Modified by: zelda.zhangze
 * @Last Modified time: 2018-07-10 13:29:14
 */

module.exports = {
  // 参照：
  // 中国内地移动终端通讯号段
  // https://zh.wikipedia.org/wiki/%E4%B8%AD%E5%9B%BD%E5%86%85%E5%9C%B0%E7%A7%BB%E5%8A%A8%E7%BB%88%E7%AB%AF%E9%80%9A%E8%AE%AF%E5%8F%B7%E6%AE%B5
  // - 移动China Mobile：134(0-8)、135、136、137、138、139、147、150、151、152、157、158、159、178、182、183、184、187、188、198
  // - 联通China Unicom：130、131、132、145、155、156、166、175、176、185、186
  // - 电信China Telecom：133、153、173、177、180、181、189、199
  // =>中国内地手机号码格式：(^130|131|132|133|135|136|137|138|139|145|147|150|151|152|153|155|156|157|158|159|166|173|175|176|177|178|180|181|182|183|184|185|186|187|188|189|198|199\d{8}$)|(^134[0-8]\d{7}$)
  // =>简化一下：(^(13[0-35-9]|14[57]|15[0-35-9]|166|17[35-8]|18[0-9]|19[89])\d{8}$)|(^134[0-8]\d{7}$)
  // mobile: /^1\d{10}$/,
  mobile: /(^(13[0-35-9]|14[57]|15[0-35-9]|166|17[35-8]|18[0-9]|19[89])\d{8}$)|(^134[0-8]\d{7}$)/,
  // qq号规则：5位以上（理论，还是限制一下吧5-11），且不可以0开头，纯数字
  qq: /^[1-9]\d{4,10}$/,
  // number: /^[-+]?\d*(\.\d*)?$/,
  // 最开始考虑觉得上面这种形式就ok了，但是没考虑到空串和单独'.'串的情况以及'+'、'-'、'+.'等异常情况
  // number: /^[-+]?(?:\d*|(?=\d))(\.\d*)?$/，这里也没有考虑上述情况
  number: /(^[-+]?\d+(\.?\d*)$)|(^[-+]?(\.?\d+)$)/,
  // 邮箱格式
  // 首先邮箱都是名称@域名的格式，部分邮箱对于名称有所限制，下面以网易邮箱对名称的限制为例（“可使用字母、数字、下划线，需以字母开头”），额，考虑到测试用例，就可以用数字或字母开头吧
  // email: /^.$/,
  email: /^[a-zA-Z0-9]\w*@[\w-]+(\.[\w-]+)+$/,
  // url: /^.$/,
  url: /^(http(s)?:\/\/)?[\w-]+(\.[\w-]+)+$/,
  // ipv4规则：四个组数字组成，每组数字之间以.分隔，每组数组取值范围0-255
  // 0-9
  // 10-99
  // 100-199
  // 200-255
  // ipv4: /^.$/,
  ipv4: /^(\d|1\d|1\d\d|2[0-4]\d|25[0-5])(\.(\d|1\d|1\d\d|2[0-4]\d|25[0-5])){3}$/,
  // 简单正则：/^\d{15}|\d{17}[\dXx]$/，无法满足测试用例
  // 更严谨版本：地址码+出生日期码+顺序码+校验码
  // 15位和18位
  idcard: /(^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx])|(^[1-9]\d{7}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}$)/,
};